inst/doc/doc/binomial-case-control-ascertainment.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-02-26 Sun 08:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Analysis of multivariate binomial data: case control or ascertainment sampling</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Klaus Holst &amp; Thomas Scheike" />
<link rel="stylesheet" type="text/css" href="orgmode5-ts.css">
</head>
<body>
<div id="preamble" class="status">

<script type="text/javascript">
  function swapStyleSheet(sheet){
      document.getElementById('pagestyle').setAttribute('href', sheet);
  }
  document.addEventListener('DOMContentLoaded',function() {
      document.getElementById('content').onclick = function() {
          var elem = document.getElementById('text-table-of-contents');
          elem.style.display = elem.style.display == 'block' ? 'none' : 'block';
      }
  });
  document.addEventListener('DOMContentLoaded',function() {
      document.getElementById('content').onclick = function() {
          var elem = document.getElementsByClassName('nav');
          for (i = 0; i < elem.length; i++) { 
               elem[i].style.display = elem[i].style.display == 'block' ? 'none' : 'block';
          }
      }
  });
</script>
</div>
<div id="content">
<h1 class="title">Analysis of multivariate binomial data: case control or ascertainment sampling</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9c792b7">Overview</a>
<ul>
<li><a href="#org67f9a6e">Case-Control Sampling</a></li>
<li><a href="#org2daee24">Ascertainment Sampling</a></li>
</ul>
</li>
<li><a href="#org172f7f5">The twin-stutter data</a></li>
<li><a href="#org8a0826f">Case Control Sampling</a></li>
<li><a href="#org0ae3b4c">Ascertaiment Sampling</a></li>
</ul>
</div>
</div>
<hr />


<div id="outline-container-org9c792b7" class="outline-2">
<h2 id="org9c792b7">Overview</h2>
<div class="outline-text-2" id="text-org9c792b7">
<p>
When looking at multivariate binomial data with the aim of learning about the 
dependence that is present, possibly after correcting for some covariates many
models are available. 
</p>

<ul class="org-ul">
<li>Random-effects models logistic regression covered elsewhere (glmer in lme4).</li>
</ul>

<p>
in the mets package you can fit the 
</p>

<ul class="org-ul">
<li>Pairwise odds ratio model</li>
<li>Bivariate Probit model 
<ul class="org-ul">
<li>With random effects</li>
<li>Special functionality for polygenic random effects modelling 
such as ACE, ADE ,AE and so forth.</li>
</ul></li>
<li>Additive gamma random effects model 
<ul class="org-ul">
<li>Special functionality for polygenic random effects modelling 
such as ACE, ADE ,AE and so forth.</li>
</ul></li>
</ul>

<p>
These last three models are all fitted in the mets package using composite 
likelihoods for pairs of data.  The models can be fitted specifically based 
on specifying which pairs one wants to use for the composite score. 
</p>

<p>
The models are described in futher details in the binomial-twin vignette. 
</p>
</div>


<div id="outline-container-org67f9a6e" class="outline-3">
<h3 id="org67f9a6e">Case-Control Sampling</h3>
<div class="outline-text-3" id="text-org67f9a6e">
<p>
Sometimes, pairs are recruited after a case-proband is selected. This 
proband, can be either  a 
</p>

<ul class="org-ul">
<li>case: must be representative of cases</li>
</ul>

<p>
or  a 
</p>

<ul class="org-ul">
<li>control: must be representative of controls</li>
</ul>

<p>
First thinking about pairs, we estimate parameters using the conditional 
likelihood given sampling wich for a binary 2 x 2 table can be 
written as
\[
\frac{P(i,j)}{P(j)}
\]
the probailty of seeing \( (i,j) \) for the pair, given that the proband was
observed as \( (j) \).
</p>


<p>
We note that if the marginal is known, or possibly estimated from the full 
cohort. Then we can estimate dependence paramters using just the terms
\( P(i,j) \) for the pairs. We can thus ignore the special sampling for
models with marginal specification.  If the marginal can not be obtained 
from other sources we need to maximize the full-pairwise-likelihood in all
paramters, that is both dependence and marginal parameters. 
</p>

<p>
Similary, one can select a whole family based on having selected a proband, that is 
selected a representative member of  either cases or controls.  In this case we 
fit the models by using composited likelihoods, considering all
pairs that involves the probands.  This will give some lacking efficiency 
compared to looking at the full likelihood of the family given the proband. 
</p>
</div>
</div>


<div id="outline-container-org2daee24" class="outline-3">
<h3 id="org2daee24">Ascertainment Sampling</h3>
<div class="outline-text-3" id="text-org2daee24">
<p>
Similarly, in the setting of pairs we can select all pairs where there is at 
least one event of interest.  
</p>

<p>
First thinking about pairs, we estimate parameters using the conditional 
likelihood given sampling wich for a binary 2 x 2 table can be 
written as
\[
\frac{P(i,j)}{1-P(0,0)}
\]
the probailty of seeing \( (i,j) \) for the pair, given that it is sampled. 
</p>

<p>
If the marginal can estimated from a full sample we can then estimate the
dependence paramter using the ascertainment likelihood.
</p>

<p>
Generally, when whole families are ascertained the computation of the
true truncation probability can be hard to the fact that families are
hard to define in the real world. Nevertheless, if a random sample of such
family is at hand. We suggest to in these families take out all pairs that 
satisfies the ascertainment criterion. With a family, with given size \( n \)
we have binary observations \( (Y_1,...,Y_n) \). The family is sampled or  a
random sample of families such that
\[ 
\sum_{i=1}^n Y_i \geq 1.
\]
We let the conditional distribution given sampling, be denoted as 
\[ 
P^O(\cdot) = P(\cdot | \sum_{i=1}^n Y_i \geq 1) 
\]
</p>

<p>
Now, we note that all pairs within these family that satisfies that 
\( Y_i+Y_j \geq 1 \), will have distribution
</p>
\begin{align*}
P^O(Y_i=o_1, Y_j=o_2 | Y_i+Y_j \geq 1)  & = \frac{P^O(o_1,o_2)}{P^O( Y_i+Y_j \geq 1)} \\
                                        & = \frac{P(Y_i=o_1,Y_j=o_2, \sum_{i=1}^n Y_i \geq 1)}{ P( Y_i+Y_j \geq 1, \sum_{i=1}^n Y_i \geq 1)} \\
                                        & = \frac{P(Y_i=o_1,Y_j=o_2) }{ P( Y_i+Y_j \geq 1)} = \frac{P(o_1,o_2)}{1 - P(0,0)} 
\end{align*}
<p>
since we only consider the probabilities where \( o_1+o_2 \geq 1 \). 
Also here we could condition on covariates. 
</p>

<p>
So considering these pairs, or a random sample of them should yield valid 
inference. When standard errors are computed we need to rely on GEE type 
arguments. An advantage of this is that the ascertainment probability is much 
easier to get for the pairs. Again using the pairwise structure will   lead
to loss of efficiency compared to using the full likelihood of the ascertained
families. 
</p>
</div>
</div>
</div>


<div id="outline-container-org172f7f5" class="outline-2">
<h2 id="org172f7f5">The twin-stutter data</h2>
<div class="outline-text-2" id="text-org172f7f5">
<p>
We consider the twin-stutter where for pairs of twins that are 
either dizygotic or monozygotic we have recorded whether the twins
are stuttering \cite{twinstut-ref}
</p>

<p>
We here consider MZ and same sex DZ twins. 
</p>

<p>
Looking at the data 
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #268bd2; font-weight: bold;">library</span>(mets)
data(twinstut)
twinstut$binstut <span style="color: #268bd2; font-weight: bold;">&lt;-</span> 1*(twinstut$stutter==<span style="color: #2aa198;">"yes"</span>)
twinsall <span style="color: #268bd2; font-weight: bold;">&lt;-</span> twinstut
twinstut <span style="color: #268bd2; font-weight: bold;">&lt;-</span> subset(twinstut,zyg<span style="color: #268bd2; font-weight: bold;">%in%</span>c(<span style="color: #2aa198;">"mz"</span>,<span style="color: #2aa198;">"dz"</span>))
head(twinstut)
</pre>
</div>

<pre class="example">
Loading required package: timereg
Loading required package: survival
Loading required package: lava
lava version 1.4.7.1
mets version 1.2.1

Attaching package: ‘mets’

The following object is masked _by_ ‘.GlobalEnv’:

    object.defined
   tvparnr zyg stutter    sex age nr binstut
1  2001005  mz      no female  71  1       0
2  2001005  mz      no female  71  2       0
3  2001006  dz      no female  71  1       0
8  2001012  mz      no female  71  1       0
9  2001012  mz      no female  71  2       0
11 2001015  dz      no   male  71  1       0
</pre>


<p>
We first select a case-control sample of this data to illustrate the use
of the methods.
</p>

<div class="org-src-container">
<pre class="src src-R"></pre>
</div>

<pre class="example">
</pre>

<p>
Secondly, we select an ascertaiment sample of the data, thus selecting
a random sample of all ascertained pairs. 
</p>
</div>
</div>


<div id="outline-container-org8a0826f" class="outline-2">
<h2 id="org8a0826f">Case Control Sampling</h2>
<div class="outline-text-2" id="text-org8a0826f">
<div class="org-src-container">
<pre class="src src-R"></pre>
</div>

<pre class="example">
</pre>
</div>
</div>

<div id="outline-container-org0ae3b4c" class="outline-2">
<h2 id="org0ae3b4c">Ascertaiment Sampling</h2>
<div class="outline-text-2" id="text-org0ae3b4c">
<div class="org-src-container">
<pre class="src src-R"></pre>
</div>

<pre class="example">
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Klaus Holst &amp; Thomas Scheike</p>
<p class="date">Created: 2017-02-26 Sun 08:12</p>
<p class="validation"></p>
</div>
</body>
</html>
